Messwerte/Archiv/Raw/apache_benchmark_repeat35/default/katafc/httpd/target_count_21/repeat_9/20.txt
2020/01/29 08:42:23 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8020/
2020/01/29 08:42:53 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 12142 requests
Server Software:        Apache/2.4.41
Server Hostname:        192.168.3.100
Server Port:            8020
Document Path:          /
Document Length:        45 bytes
Concurrency Level:      100
Time taken for tests:   30.000 seconds
Complete requests:      12142
Failed requests:        0
Total transferred:      3509038 bytes
HTML transferred:       546390 bytes
Requests per second:    404.73 [#/sec] (mean)
Time per request:       247.077 [ms] (mean)
Time per request:       2.471 [ms] (mean, across all concurrent requests)
Transfer rate:          114.23 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   6.1      1      98
Processing:     3  245 252.1    106    1434
Waiting:        2  239 244.4    105    1275
Total:          8  247 252.2    107    1435
Percentage of the requests served within a certain time (ms)
  50%    107
  66%    286
  75%    454
  80%    540
  90%    658
  95%    693
  98%    747
  99%    800
 100%   1435 (longest request)
2020/01/29 08:42:53 Matched stat line [Connect:        0    2   6.1      1      98 Connect 0 2 6.1 1 98]
2020/01/29 08:42:53 Matched stat line [Processing:     3  245 252.1    106    1434 Processing 3 245 252.1 106 1434]
2020/01/29 08:42:53 Matched stat line [Waiting:        2  239 244.4    105    1275 Waiting 2 239 244.4 105 1275]
2020/01/29 08:42:53 Matched stat line [Total:          8  247 252.2    107    1435 Total 8 247 252.2 107 1435]
2020/01/29 08:42:53 Matched percentline [  50%    107 50 107]
2020/01/29 08:42:53 Matched percentline [  66%    286 66 286]
2020/01/29 08:42:53 Matched percentline [  75%    454 75 454]
2020/01/29 08:42:53 Matched percentline [  80%    540 80 540]
{"connect":{"max":98,"mean":2,"median":1,"min":0,"stdDev":6.099999904632568},"percentiles":{"100":1435,"50":107,"66":286,"75":454,"80":540,"90":658,"95":693,"98":747,"99":800},"processing":{"max":1434,"mean":245,"median":106,"min":3,"stdDev":252.10000610351562},"total":{"max":1435,"mean":247,"median":107,"min":8,"stdDev":252.1999969482422},"waiting":{"max":1275,"mean":239,"median":105,"min":2,"stdDev":244.39999389648438}}
2020/01/29 08:42:53 Matched percentline [  90%    658 90 658]
2020/01/29 08:42:53 Matched percentline [  95%    693 95 693]
2020/01/29 08:42:53 Matched percentline [  98%    747 98 747]
2020/01/29 08:42:53 Matched percentline [  99%    800 99 800]
2020/01/29 08:42:53 Matched percentline [ 100%   1435 100 1435]